/* 
    - Основи подій. Створення та видалення слухачів
    - Об'єкт події
    - Скасування поведінки браузера за замовчуванням
    - Події click, change, input, submit, focus, blur


    Створити форму реєстрації користувача за допомогою js де буде 2 поля 
        1. Поле логіна
        2. Поле пароль
        3. Захаркодити вірні логін і пароль в константах
        4. Додати логіку сабміта форми, при сабміті перевіряємо введені логін і пароль.
            1. Якщо логін і пароль співпадають - видаляємо форму з документа і 
            показуємо **h2**  з написом **“Вхід успішний”** - h2>Вхід успішний</h2>
            2. Якщо логін і пароль не співпадають з даними з констант в пункті 3с - 
            показуємо під формою помилку червоним кольором **“Логін або пароль не вірні”**
*/
