/* 
  - Спливання подій
  - Делегування подій

  Створити калькулятор вартості продукту взалежності від ціни. 
    При роботі з подіями використовувати делагування.

  Вимоги:
  - Відрендерити всю розмітку через JS
  - Кольрова підказка інпута №2 має змінювати своє значення при перетягувані повзунка.
  - При змінні данних в інпуті №1 чи №2 автоматично має перераховуватися загальна вартість
  - Загальна сума відображається з копійками (2 знаки після коми)
  - Завжди має відображатися валюта - гривня
  - При завантаженні сторінки скрипт має автоматично розрахувати вартість на основі 
    данних за замовчуванням які ви встановите в розмітці.

    <div class="container">
    <h2 class="title">Скільки коштує мясо на шашлики?</h2>
    <form action="#" class="form">
      <label for="price">Ціна грн</label>
      <input type="text" id="price" name="price" value="50">
      <label for="quantity">Кількість<span class="amount">1</span>кг</label>
      <input type="range" id="quantity" name="quantity" value="1" min="1", max="20">
    </form>
    <p class="text-right total">0</p>
    </div>
*/
